using System;

namespace KiDung
{
    public class CheckCT
    {
        //mang amdau1 chua cac am co the dung dau, ngoai tru cac am co the dung mot minh
        public string[] amdau = new string[] { "a", "á", "à", "ả", "ạ", "ă", "â", "ẩ", "b", "c", "d", "đ", "e", "ê", "ế", "g", "h", "i",
            "ì", "ỉ", "k", "l", "m", "n", "o", "ó", "ô", "ố", "ồ", "ổ", "ơ", "ớ", "ờ", "ở", "ợ",
            "p", "q", "r", "s", "t", "u", "ú", "ù", "ủ", "ụ", "ư", "ứ", "ừ", "ử", "v", "x", "y", "ý", "ỷ", "ch", "gh",
            "gi", "kh", "ng", "ngh", "nh", "ph", "th", "tr", "ph", "qu" };

        public string[] amdau_dung_mot_minh = new string[] { "a", "á", "à", "ả", "ạ", "ê", "ế", "i",
            "ì", "ỉ", "ó", "ô", "ố", "ồ", "ổ", "ơ", "ớ", "ờ", "ở", "ợ",
            "u", "ú", "ù", "ủ", "ụ", "ư", "ứ", "ừ", "ử", "y", "ý", "ỷ" };

        public string[] amcuoi = new string[] {
            "a", "á", "à", "ả", "ã", "ạ", "e", "é", "è", "ẻ", "ẽ", "ẹ", "ê", "ế", "ề", "ể", "ễ", "ệ",
            "i", "í", "ì", "ỉ", "ĩ", "ị", "o", "ó", "ò", "ỏ", "õ", "ọ", "ô", "ố", "ồ", "ổ", "ỗ", "ộ", "ơ", "ớ", "ờ", "ở", "ỡ", "ợ",
            "u", "ú", "ù", "ủ", "ũ", "ụ", "ư", "ứ", "ừ", "ử", "ữ", "ự", "y", "ý", "ỳ", "ỷ", "ỵ",
            "ác", "ạc", "ai", "ái", "ài", "ải", "ãi","ại", "am", "ám", "àm", "ảm", "ãm", "ạm", "an", "án", "àn", "ản", "ãn", "ạn",
            "ao", "áo", "ào", "ảo", "ão", "ạo", "áp", "ạp", "át", "ạt", "au", "áu", "àu", "ay", "áy", "ày", "ảy", "ãy", "ạy",
            "ắc", "ặc", "ăm", "ắm", "ằm", "ẳm", "ẵm", "ặm", "ăn", "ắn", "ằn", "ẳn", "ắt", "ặt", "ặn",
            "ấc", "ậc", "âm", "ấm", "ầm", "ẩm", "ẫm", "ậm", "ân", "ấn", "ần", "ẩn", "ẫn", "ận", "ất", "ật", "âu", "ấu", "ầu", "ẩu", "ẫu", "ậu",
            "éc", "ẹc", "em", "ém", "èm", "ẻm", "ẽm", "ẹm", "en", "én", "èn", "ẻn", "ẽn", "ẹn", "eo", "éo", "èo", "ẻo", "ẽo", "ẹo",
            "ép", "ẹp", "ét", "ẹt", "êm", "ếm", "ềm", "ệm", "ên", "ến", "ền", "ển", "ện", "ếp", "ệp", "êu", "ếu", "ều", "ểu",
            "ia", "ía", "ìa", "ỉa", "ĩa", "ịa", "im", "ím", "ìm", "ỉm", "ĩm", "ịm", "in", "ín", "ìn", "ỉn", "ịn", "íp", "ịp", "ít", "ịt",
            "oa", "óa", "òa", "ỏa", "õa", "ọa", "óc", "ọc", "oe", "óe", "ỏe", "ọe", "oi", "ói", "òi", "ỏi", "õi", "ọi",
            "om", "óm", "òm", "ỏm", "õm", "ọm", "on", "ón", "òn", "ỏn", "õn", "ọn", "óp", "ọp", "ót", "ọt", "ốc", "ộc",
            "ôi", "ối", "ồi", "ổi", "ỗi", "ội", "ôm", "ốm", "ồm", "ổm", "ộm", "ôn", "ốn", "ồn", "ổn", "ỗn", "ộn", "ốp", "ộp",
            "ốt", "ột", "ơi", "ới", "ời", "ởi", "ỡi", "ợi", "ơm", "ớm", "ờm", "ởm", "ỡm", "ợm", "ơn", "ớn", "ờn", "ởn", "ỡn", "ợn",
            "ớp", "ợp", "ua", "úa", "uá", "ùa", "uà", "ủa", "uả", "ũa", "ụa", "uạ", "úc", "ục", "uê", "uế", "uề", "uể", "uệ", "ui", "úi", "ùi", "ủi", "ũi", "ụi",
            "um", "úm", "ùm", "ủm", "ũm", "ụm", "un", "ún", "ùn", "ủn", "ũn", "ụn", "úp", "ụp", "út", "ụt", "ưa", "ứa", "ừa", "ửa", "ữa", "ựa",
            "ức", "ực", "ửi", "ứt", "uy", "úy", "uý", "uỳ", "ủy", "uỷ", "uỹ", "uỵ",
            "ách", "ạch", "ang", "àng", "ảng", "ãng", "ạng", "anh", "ành", "ảnh", "ãnh", "ạnh", "ếch", "ệch", "ênh", "ệnh", "ích", "ịch",
            "inh", "ính", "ình", "ỉnh", "ĩnh", "ịnh", "iên", "iến", "iền", "iển", "iễn", "iện", "iêm", "iếm", "iềm", "iểm", "iễm", "iệm",
            "oai", "oái", "oài", "oải", "oại",
            "oăn", "oắn", "oằn", "oặn", "oan", "oán", "oàn", "oản", "oãn", "oạn", "ong", "óng", "òng", "ỏng", "õng", "ọng",
            "oay", "oáy",
            "ông", "ống", "ồng", "ổng", "ỗng", "ộng", "ung", "úng", "ùng", "ủng", "ũng", "ụng", "uôn", "uốn", "uồn", "uộn",
            "uây", "uấy", "uầy", "uẫy", "uậy",
            "ươn", "ướn", "ườn", "ượn", "ưng", "ứng", "ừng", "ửng", "ững", "ựng",
            "iêng", "iếng", "iềng", "iệng", "uyên", "uyến", "uyền", "uyển", "uyễn", "uyện",
            "oang", "oáng", "oàng", "oảng", "oãng", "oạng", "uynh", "uỳnh", "uých", "uỳnh", "uỵch",
            "uông","uống","uồng","uổng","uộng", "ương", "ướng", "ường", "ưởng", "ưỡng", "ượng"
            };

        public string[] amcuoi_dung_mot_minh = new string[] {
            "ác", "ai", "ái", "ải", "am", "ám", "ảm", "an", "án",
            "ao", "áo", "ào", "ảo", "áp", "át", "ạt", "au", "ay", "áy",
            "ặc", "ẵm", "ăn", "ắt",
            "âm", "ấm", "ầm", "ẩm", "ân", "ấn", "ẩn", "ất", "âu", "ấu", "ẩu",
            "éc", "ẹc", "em", "ém", "ẻm", "én", "eo", "éo", "èo", "ẻo", "ẽo",
            "ép", "ét", "êm", "ếp",
            "ỉa", "im", "ím", "ỉm", "in", "ỉn", "ít", "ịt",
            "oa", "òa", "óc", "ọc", "oe", "óe", "ọe", "oi", "ói", "ỏi",
            "om", "óp", "ốc", "ộc",
            "ôi", "ối", "ổi", "ôm", "ốm", "ồm", "ôn", "ồn", "ổn", "ốp", "ộp",
            "ốt", "ơi", "ới", "ờm", "ơn", "ớn",
            "ua", "úa", "ùa", "ủa", "úc", "ục", "ui", "úi", "ủi",
            "um", "úm", "ùm", "ùn", "ủn", "ụn", "úp", "ụp", "út", "ụt", "ứa", "ựa",
            "ức", "ực", "úy", "ủy",
            "ách", "ạch", "ang", "anh", "ảnh", "ếch", "ích", "ịch",
            "inh",
            "oai", "oái", "oải",
            "oẳn", "oan", "oán", "oản", "ong", "óng",
            "ông", "ống", "ổng", "ung", "úng", "ủng", "uốn",
            "ươn", "ưng", "ứng", "ửng",
            "uyên", "uyển", "uyễn",
            "oang", "uynh", "uỳnh", "uỳnh", "uỵch",
            "uông", "uống", "uổng", "ương"
        };

        public string[] cac_cap_am_khong_duoc_dung_cung_nhau = new string[] {
            /*cac nguyen am khong duoc dung canh nhau*/
            "aa","aá","aà","aã","aạ","aả","aâ","aấ","aầ","aẫ","aậ","aẩ","aă","aắ","aằ","aặ","aẵ","aẳ","aí","aì","aị","aĩ","aỉ","aý","aỳ",
            "aỵ","aỹ","aỷ","ae","aé","aè","aẹ","aẻ","aẽ","aê","aế","aề","aệ","aễ","aể","aó","aò","aọ","aỏ","aõ","aô","aố","aồ","aộ","aỗ",
            "aổ","aơ","aờ","aớ","aợ","aỡ","aở","aú","aù","aụ","aũ","aủ","aư","aứ","aừ","aự","aữ","aử","âa","âá","âà","âã","âạ","âả","ââ",
            "âấ","âầ","âẫ","âậ","âẩ","âă","âắ","âằ","âặ","âẵ","âẳ","âi","âí","âì","âị","âĩ","âỉ","âý","âỳ","âỵ","âỹ","âỷ","âe","âé","âè",
            "âẹ","âẻ","âẽ","âê","âế","âề","âệ","âễ","âể","âo","âó","âò","âọ","âỏ","âõ","âô","âố","âồ","âộ","âỗ","âổ","âơ","âờ","âớ","âợ",
            "âỡ","âở","âú","âù","âụ","âũ","âủ","âư","âứ","âừ","âự","âữ","âử","ăa","ăá","ăà","ăã","ăạ","ăả","ăâ","ăấ","ăầ","ăẫ","ăậ","ăẩ",
            "ăă","ăắ","ăằ","ăặ","ăẵ","ăẳ","ăi","ăí","ăì","ăị","ăĩ","ăỉ","ăy","ăý","ăỳ","ăỵ","ăỹ","ăỷ","ăe","ăé","ăè","ăẹ","ăẻ","ăẽ","ăê",
            "ăế","ăề","ăệ","ăễ","ăể","ăo","ăó","ăò","ăọ","ăỏ","ăõ","ăô","ăố","ăồ","ăộ","ăỗ","ăổ","ăơ","ăờ","ăớ","ăợ","ăỡ","ăở","ău","ăú",
            "ăù","ăụ","ăũ","ăủ","ăư","ăứ","ăừ","ăự","ăữ","ăử","iá","ià","iã","iạ","iả","iâ","iấ","iầ","iẫ","iậ","iẩ","iă","iắ","iằ","iặ",
            "iẵ","iẳ","ii","ií","iì","iị","iĩ","iỉ","iy","iý","iỳ","iỵ","iỹ","iỷ","ie","ié","iè","iẹ","iẻ","iẽ","io","ió","iò","iọ","iỏ",
            "iõ","iô","iố","iồ","iộ","iỗ","iổ","iơ","iờ","iớ","iợ","iỡ","iở","iú","iù","iụ","iũ","iủ","iư","iứ","iừ","iự","iữ","iử","yá",
            "yà","yã","yạ","yả","yâ","yấ","yầ","yẫ","yậ","yẩ","yă","yắ","yằ","yặ","yẵ","yẳ","yi","yí","yì","yị","yĩ","yỉ","yy","yý","yỳ",
            "yỵ","yỹ","yỷ","ye","yé","yè","yẹ","yẻ","yẽ","yo","yó","yò","yọ","yỏ","yõ","yô","yố","yồ","yộ","yỗ","yổ","yơ","yờ","yớ","yợ",
            "yỡ","yở","yu","yú","yù","yụ","yũ","yủ","yư","yứ","yừ","yự","yữ","yử","ea","eá","eà","eã","eạ","eả","eâ","eấ","eầ","eẫ","eậ",
            "eẩ","eă","eắ","eằ","eặ","eẵ","eẳ","ei","eí","eì","eị","eĩ","eỉ","ey","eý","eỳ","eỵ","eỹ","eỷ","ee","eé","eè","eẹ","eẻ","eẽ",
            "eê","eế","eề","eệ","eễ","eể","eó","eò","eọ","eỏ","eõ","eô","eố","eồ","eộ","eỗ","eổ","eơ","eờ","eớ","eợ","eỡ","eở","eu","eú",
            "eù","eụ","eũ","eủ","eư","eứ","eừ","eự","eữ","eử","êa","êá","êà","êã","êạ","êả","êâ","êấ","êầ","êẫ","êậ","êẩ","êă","êắ","êằ",
            "êặ","êẵ","êẳ","êi","êí","êì","êị","êĩ","êỉ","êy","êý","êỳ","êỵ","êỹ","êỷ","êe","êé","êè","êẹ","êẻ","êẽ","êê","êế","êề","êệ",
            "êễ","êể","êo","êó","êò","êọ","êỏ","êõ","êô","êố","êồ","êộ","êỗ","êổ","êơ","êờ","êớ","êợ","êỡ","êở","êú","êù","êụ","êũ","êủ",
            "êư","êứ","êừ","êự","êữ","êử","oâ","oấ","oầ","oẫ","oậ","oẩ","oí","oì","oị","oĩ","oỉ","oy","oý","oỳ","oỵ","oỹ","oỷ","oè","oẻ",
            "oẽ","oê","oế","oề","oệ","oễ","oể","oò","oỏ","oõ","oô","oố","oồ","oộ","oỗ","oổ","oơ","oờ","oớ","oợ","oỡ","oở","ou","oú","où",
            "oụ","oũ","oủ","oư","oứ","oừ","oự","oữ","oử","ôa","ôá","ôà","ôã","ôạ","ôả","ôâ","ôấ","ôầ","ôẫ","ôậ","ôẩ","ôă","ôắ","ôằ","ôặ",
            "ôẵ","ôẳ","ôí","ôì","ôị","ôĩ","ôỉ","ôy","ôý","ôỳ","ôỵ","ôỹ","ôỷ","ôe","ôé","ôè","ôẹ","ôẻ","ôẽ","ôê","ôế","ôề","ôệ","ôễ","ôể",
            "ôo","ôó","ôò","ôọ","ôỏ","ôõ","ôô","ôố","ôồ","ôộ","ôỗ","ôổ","ôơ","ôờ","ôớ","ôợ","ôỡ","ôở","ôu","ôú","ôù","ôụ","ôũ","ôủ","ôư",
            "ôứ","ôừ","ôự","ôữ","ôử","ơa","ơá","ơà","ơã","ơạ","ơả","ơâ","ơấ","ơầ","ơẫ","ơậ","ơẩ","ơă","ơắ","ơằ","ơặ","ơẵ","ơẳ","ơí","ơì",
            "ơị","ơĩ","ơỉ","ơy","ơý","ơỳ","ơỵ","ơỹ","ơỷ","ơe","ơé","ơè","ơẹ","ơẻ","ơẽ","ơê","ơế","ơề","ơệ","ơễ","ơể","ơo","ơó","ơò","ơọ",
            "ơỏ","ơõ","ơô","ơố","ơồ","ơộ","ơỗ","ơổ","ơơ","ơờ","ơớ","ơợ","ơỡ","ơở","ơú","ơù","ơụ","ơũ","ơủ","ơư","ơứ","ơừ","ơự","ơữ","ơử",
            "uá","uà","uã","uạ","uả","uă","uắ","uằ","uặ","uẵ","uẳ","uí","uì","uị","uĩ","uỉ","ue","ué","uè","uẹ","uẻ","uẽ","uo","uó","uò",
            "uọ","uỏ","uõ","uơ","uờ","uớ","uợ","uỡ","uở","uu","uú","uù","uụ","uũ","uủ","uư","uứ","uừ","uự","uữ","uử","ưá","ưà","ưã","ưạ",
            "ưả","ưâ","ưấ","ưầ","ưẫ","ưậ","ưẩ","ưă","ưắ","ưằ","ưặ","ưẵ","ưẳ","ưi","ưí","ưì","ưị","ưĩ","ưỉ","ưy","ưý","ưỳ","ưỵ","ưỹ","ưỷ",
            "ưe","ưé","ưè","ưẹ","ưẻ","ưẽ","ưê","ưế","ưề","ưệ","ưễ","ưể","ưo","ưó","ưò","ưọ","ưỏ","ưõ","ưô","ưố","ưồ","ưộ","ưỗ","ưổ","ưu",
            "ưú","ưù","ưụ","ưũ","ưủ","ưư","ưứ","ưừ","ưự","ưữ","ưử","áa","áâ","áă","áe","áê","áô","áơ","áư","àa","àâ","àă","àe","àê","àô",
            "àơ","àư","ãa","ãâ","ãă","ãe","ãê","ãô","ãơ","ãư","ạa","ạâ","ạă","ạe","ạê","ạô","ạơ","ạu","ạư","ảa","ảâ","ảă","ảe","ảê","ảô",
            "ảơ","ảư","ấa","ấâ","ấă","ấi","ấe","ấê","ấo","ấô","ấơ","ấư","ầa","ầâ","ầă","ầi","ầe","ầê","ầo","ầô","ầơ","ầư","ẫa","ẫâ","ẫă",
            "ẫi","ẫe","ẫê","ẫo","ẫô","ẫơ","ẫư","ậa","ậâ","ậă","ậi","ậe","ậê","ậo","ậô","ậơ","ậư","ẩa","ẩâ","ẩă","ẩi","ẩe","ẩê","ẩo","ẩô",
            "ẩơ","ẩư","ắa","ắâ","ắă","ắi","ắy","ắe","ắê","ắo","ắô","ắơ","ắu","ắư","ằa","ằâ","ằă","ằi","ằy","ằe","ằê","ằo","ằô","ằơ","ằu",
            "ằư","ặa","ặâ","ặă","ặi","ặy","ặe","ặê","ặo","ặô","ặơ","ặu","ặư","ẵa","ẵâ","ẵă","ẵi","ẵy","ẵe","ẵê","ẵo","ẵô","ẵơ","ẵu","ẵư",
            "ẳa","ẳâ","ẳă","ẳi","ẳy","ẳe","ẳê","ẳo","ẳô","ẳơ","ẳu","ẳư","íâ","íă","íi","íy","íe","íê","ío","íô","íơ","íư","ìâ","ìă","ìi",
            "ìy","ìe","ìê","ìo","ìô","ìơ","ìư","ịâ","ịă","ịi","ịy","ịe","ịê","ịo","ịô","ịơ","ịư","ĩâ","ĩă","ĩi","ĩy","ĩe","ĩê","ĩo","ĩô",
            "ĩơ","ĩư","ỉâ","ỉă","ỉi","ỉy","ỉe","ỉê","ỉo","ỉô","ỉơ","ỉư","ýa","ýâ","ýă","ýi","ýy","ýe","ýê","ýo","ýô","ýơ","ýu","ýư","ỳa",
            "ỳâ","ỳă","ỳi","ỳy","ỳe","ỳê","ỳo","ỳô","ỳơ","ỳu","ỳư","ỵa","ỵâ","ỵă","ỵi","ỵy","ỵe","ỵê","ỵo","ỵô","ỵơ","ỵu","ỵư","ỹa","ỹâ",
            "ỹă","ỹi","ỹy","ỹe","ỹê","ỹo","ỹô","ỹơ","ỹu","ỹư","ỷa","ỷâ","ỷă","ỷi","ỷy","ỷe","ỷê","ỷo","ỷô","ỷơ","ỷu","ỷư","éa","éâ","éă",
            "éi","éy","ée","éê","éô","éơ","éu","éư","èa","èâ","èă","èi","èy","èe","èê","èô","èơ","èu","èư","ẹa","ẹâ","ẹă","ẹi","ẹy","ẹe",
            "ẹê","ẹô","ẹơ","ẹu","ẹư","ẻa","ẻâ","ẻă","ẻi","ẻy","ẻe","ẻê","ẻô","ẻơ","ẻu","ẻư","ẽa","ẽâ","ẽă","ẽi","ẽy","ẽe","ẽê","ẽô","ẽơ",
            "ẽu","ẽư","ếa","ếâ","ếă","ếi","ếy","ếe","ếê","ếo","ếô","ếơ","ếư","ềa","ềâ","ềă","ềi","ềy","ềe","ềê","ềo","ềô","ềơ","ềư","ệa",
            "ệâ","ệă","ệi","ệy","ệe","ệê","ệo","ệô","ệơ","ệư","ễa","ễâ","ễă","ễi","ễy","ễe","ễê","ễo","ễô","ễơ","ễư","ểa","ểâ","ểă","ểi",
            "ểy","ểe","ểê","ểo","ểô","ểơ","ểư","óâ","óă","óy","óê","óô","óơ","óu","óư","òâ","òă","òy","òê","òo","òô","òơ","òu","òư","ọâ",
            "ọă","ọy","ọê","ọô","ọơ","ọu","ọư","ỏâ","ỏă","ỏy","ỏê","ỏo","ỏô","ỏơ","ỏu","ỏư","õâ","õă","õy","õê","õo","õô","õơ","õu","õư",
            "ốa","ốâ","ốă","ốy","ốe","ốê","ốo","ốô","ốơ","ốu","ốư","ồa","ồâ","ồă","ồy","ồe","ồê","ồo","ồô","ồơ","ồu","ồư","ộa","ộâ","ộă",
            "ộy","ộe","ộê","ộo","ộô","ộơ","ộu","ộư","ỗa","ỗâ","ỗă","ỗy","ỗe","ỗê","ỗo","ỗô","ỗơ","ỗu","ỗư","ổa","ổâ","ổă","ổy","ổe","ổê",
            "ổo","ổô","ổơ","ổu","ổư","ờa","ờâ","ờă","ờy","ờe","ờê","ờo","ờô","ờơ","ờư","ớa","ớâ","ớă","ớy","ớe","ớê","ớo","ớô","ớơ","ớư",
            "ợa","ợâ","ợă","ợy","ợe","ợê","ợo","ợô","ợơ","ợư","ỡa","ỡâ","ỡă","ỡy","ỡe","ỡê","ỡo","ỡô","ỡơ","ỡư","ởa","ởâ","ởă","ởy","ởe",
            "ởê","ởo","ởô","ởơ","ởư","úâ","úă","úe","úê","úo","úô","úơ","úu","úư","ùâ","ùă","ùe","ùê","ùo","ùô","ùơ","ùu","ùư","ụâ","ụă",
            "ụe","ụê","ụo","ụô","ụơ","ụu","ụư","ũâ","ũă","ũe","ũê","ũo","ũô","ũơ","ũu","ũư","ủâ","ủă","ủe","ủê","ủo","ủô","ủơ","ủu","ủư",
            "ứâ","ứă","ứy","ứe","ứê","ứo","ứô","ứơ","ứư","ừâ","ừă","ừy","ừe","ừê","ừo","ừô","ừơ","ừư","ựâ","ựă","ựy","ựe","ựê","ựo","ựô",
            "ựơ","ựư","ữâ","ữă","ữy","ữe","ữê","ữo","ữô","ữơ","ữư","ửâ","ửă","ửy","ửe","ửê","ửo","ửô","ửơ" ,"ửư"
            /*cac cap am khac khong duoc dung canh nhau*/
        };

        public CheckCT()
        {
        }

        public bool checklength(string word)
        {
            if (word.Length > 7)
                return false;
            return true;
        }


        
        //kiem tra tu co am dau voi am cuoi thoa man khong
        public bool check(string word)
        {
            string tmpword = word.ToLower();
            string[] am_tiet = tmpword.ToCharArray().Select(c => c.ToString()).ToArray();
            int index = 0;
            bool checkdau = true, checkcuoi = false, checkgiua = true;
            string amdautmp = "", amcuoitmp = "";

            //check am dau
            while (check1)
            {
                amdautmp += am_tiet[index];
                bool check1tmp = false;
                foreach(string ad in amdau)
                {
                    if (amdautmp == ad)
                    {
                        if (index < (word.Length - 1))
                        {
                            index += 1;
                        }    
                        check1tmp = true;
                        break;
                    }
                }

                if(check1tmp == false)
                {
                    if (index == 0) checkdau = false;
                    break;
                }
                else
                {
                    if (index == (word.Length - 1)) break;
                }
            }


            //check am cuoi
            if (checkdau == true)
            {
                /*neu ca word la mot am dau, can kiem tra xem am dau nay co duoc dung mot minh khong*/
                if(index == (word.Length - 1))
                {
                    foreach(string ad in amdau_dung_mot_minh)
                    {
                        if(amdautmp == ad)
                        {
                            checkcuoi = true;
                            break;
                        }
                    }
                }
                /*neu khong, can kiem tra phan con lai cua word co nam trong amcuoi[] khong*/
                else
                {
                    for (int i = index; i < word.Length; i++)
                    {
                        amcuoitmp += am_tiet[i];
                    }

                    //neu tu bi lap lai am dau, tu do chac chan sai chinh ta VD: "aa", "bb"
                    if ((amdautmp - am_tiet[index]) == amcuoitmp) checkcuoi == false;
                    else
                    {
                        foreach (string ac in amcuoi)
                        {
                            if (amcuoitmp == ac)
                            {
                                checkcuoi = true;
                                checkgiua = false;//can phai kiem tra tiep amgiua cua word o phan duoi
                                break;
                            }
                        }

                        /*neu check phan con lai cua word khong nam trong amcuoi[],
                         *  thi can check ca cum tu xem co nam trong amcuoi_dung_mot_minh[] khong
                         *  vi doi khi mot van cung co the la mot tu vidu: "an"*/
                        if (checkcuoi == false)
                        {
                            amdautmp -= am_tiet[index];
                            amcuoitmp = amdautmp + amcuoitmp;
                            foreach (string ac in amcuoi_dung_mot_minh)
                            {
                                if (amcuoitmp == ac)
                                {
                                    checkcuoi = true;
                                    break;
                                }
                            }
                        }
                    }    
                }              
            }

            /*neu da kiem tra am dau va am cuoi cua tu thoa man, thi can kiem tra xem hai am do co duoc di cung nhau khong.
             * (khong can kiem tra hai truong hop ca am dau la mot tu hoac ca am cuoi la mot tu)
             */
            if ((checkdau == true) && (checkcuoi == true) && (checkgiua == false))
            {
                checkgiua = true;
                string amgiuatmp = am_tiet[index - 1] + am_tiet[index];
                foreach (string ag in cac_cap_am_khong_duoc_dung_cung_nhau)
                {
                    if (amgiuatmp == ag)
                    {
                        checkgiua = false;
                        break;
                    }
                }

                if (checkgiua == true) return true;
            }
            else if ((checkdau == true) && (checkcuoi == true) && (checkgiua == true)) return true;
            else return false;
        }
    }
}

